"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
"""


user_num = int(input("Введите номер месяца от 1 до 12: "))
if user_num <= 0 or user_num > 12:
    print("Такого месяца не существует!")
else:
    seasons_list = ["Зима", "Зима",
                    "Весна", "Весна", "Весна",
                    "Лето", "Лето", "Лето",
                    "Осень", "Осень", "Осень",
                    "Зима"]
    print(seasons_list[user_num - 1])
    seasons_dic = {1: "Зима", 2: "Зима", 3: "Весна",
                   4: "Весна", 5: "Весна", 6: "Лето",
                   7: "Лето", 8: "Лето", 9: "Осень",
                   10: "Осень", 11: "Осень", 12: "Зима"}
    print(seasons_dic.get(user_num))
